src/Catalogs/Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Кассы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеСписаниеМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтСдачаВыемкиПриЗакрытииСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьПечатьЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФФДдляККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнееОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыемкаИзКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершатьАвтоматическиОперацииВемкиВнесения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДляСдачиВыручки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККММарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМНомерПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМНомерРегистрационный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаватьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьКопииЧеков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьКопииЧековКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКассира</Name>
					<Comment>0 - "Фамилия Имя Отчество"1. "Фамилия Имя"2. "Фамилия И.О."3. "Фамилия И."4. "Фамилия"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетЭлектронногоЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКасс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматТелефонногоНомераДляОтправкиЭлектронныхЧековККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекEmailПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекSMSПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Секции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СегментНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробиватьНефискальныйЧек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИспользовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭквайринговыеТерминалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭквайринговыйТерминал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыКасс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКасс</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КассаПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперационнаяКасса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Кассы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Если Объект.СтруктурнаяЕдиница.Пустая() Тогда
		 Объект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;        
		 Объект.ТипКассы 		   = Перечисления.ТипыКасс.ОперационнаяКасса;
	КонецЕсли;
	
	// Подсистема запрета редактирования ключевых реквизитов объектов
	// ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
		
	Если Объект.ВидыОплат.Количество() = 0 Тогда
		
		// Заполнение ТБ доступных видов оплат
		ЗапросВидовОплат = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТипыОплат.Ссылка КАК ВидОплаты
		|ИЗ
		|	Перечисление.ТипыДенежныхСредств КАК ТипыОплат
		|ГДЕ
		|	ТипыОплат.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.Безналичные)");
		
		Объект.ВидыОплат.Загрузить(ЗапросВидовОплат.Выполнить().Выгрузить());
		
	КонецЕсли;
	ИспользоватьФР = Не Объект.ИспользоватьБезПодключенияОборудования;
	
	УстановитьСотсояниеЭлементов();
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
    ВывестиДинамическиеЭлементыТЧ();
	
КонецПроцедуры

&НаКлиенте
// Процедура Перед записью.
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ЗавершатьАвтоматическиОперацииВемкиВнесения И НЕ ЗначениеЗаполнено(Объект.КассаДляСдачиВыручки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена касса предприятия!'; en = 'The cash desk of the enterprise is not filled!'"));
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура, обработчик события ПриИзменении
//
Процедура ИспользоватьБезПодключенияОборудованияПриИзменении(Элемент)

	//Объект.ИспользоватьБезПодключенияОборудования = Не ИспользоватьФР;
	УстановитьСотсояниеЭлементов();
		
КонецПроцедуры
                                                                          					                                
&НаКлиенте
// Процедура, обработчик события "НачалоВыбора" поле ввода "Склад"
//
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		СтандартнаяОбработка = Ложь;
	
		ОткрытьФорму("Справочник.Склады.ФормаВыбора",
		Новый Структура("Отбор", Объект.Организация),,,,,
		Новый ОписаниеОповещения("СкладНачалоВыбораЗавершение", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора склада
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СкладНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		Объект.Склад = РезультатВыбора;
		Модифицированность = Истина;
	КонецЕсли; 	
	
КонецПроцедуры

// Процедура - Внешнее оборудование начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаКлиенте
Процедура ВнешнееОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.ЗагрузитьЗначения(ПолучитьМассивФрИкКТ());
	 	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПечатьКопииЧекаПриИзменении(Элемент)
	
	УстановитьСотсояниеЭлементов();

КонецПроцедуры  

#Область ОбработчикиТабличнойЧастиВидыОплаты

&НаКлиенте
// Обработчик начала добавления
//
Процедура ВидыОплатПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ  = Истина;
	
КонецПроцедуры

&НаКлиенте
// Обработчик перед удалением строки
//
Процедура ВидыОплатПередУдалением(Элемент, Отказ)
	
	Отказ  = Истина;
	
КонецПроцедуры

&НаКлиенте
// Обработчи при окончании редактирования значения
//
Процедура ВидыОплатПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущиеДанные.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") 
		ИЛИ Элемент.ТекущиеДанные.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта") Тогда
		Если Элемент.ТекущиеДанные.ПробиватьНефискальныйЧек Тогда
			Элемент.ТекущиеДанные.ПробиватьНефискальныйЧек = Ложь; 		
			ПоказатьПредупреждение(,"Для данного вида оплаты невозможно использование не фискального чека!");
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Устанвоить состояние элементов формы
Процедура УстановитьСотсояниеЭлементов()
	
	Элементы.ИнофрмацияПоККМ.Видимость = Не Объект.ИспользоватьБезПодключенияОборудования;
    Элементы.ВнешнееОборудование.Доступность = Не Объект.ИспользоватьБезПодключенияОборудования;
	Элементы.ГруппаФорматТелефонногоНомераДляОтправкиЭлектронныхЧековККМ.Видимость = Константы.СтранаУчета.Получить().Код = "643"; //Только для РФ
	
	Элементы.ПечатьКопииЧекаКоличество.Видимость = Объект.ПечатьКопииЧеков = Истина;
	
	ЭтоОперационнаяКасса = Объект.ТипКассы = ПредопределенноеЗначение("Перечисление.ТипыКасс.ОперационнаяКасса"); 	
	Элементы.ГруппаОперационнаяКасса.Видимость = ЭтоОперационнаяКасса;
	
	ВыемкаСдачаНаличныхВбанк = Объект.ВыемкаИзКассы = ПредопределенноеЗначение("Перечисление.ВидыОпераций.СдачаНаличныхВБанк");	
	
	Если ВыемкаСдачаНаличныхВбанк Тогда
		Объект.КассаДляСдачиВыручки 		  = Неопределено;		
		Объект.ЗавершатьАвтоматическиОперацииВемкиВнесения = Ложь;
	КонецЕсли;
	
	Элементы.ЗавершатьОперацииВыемки.Видимость = НЕ ВыемкаСдачаНаличныхВбанк;
	
	Элементы.ГруппаКассаПредприятия.Видимость  = Объект.ЗавершатьАвтоматическиОперацииВемкиВнесения И НЕ ВыемкаСдачаНаличныхВбанк;
	Элементы.КассаДляСдачиВыручки.Видимость	   = Объект.ЗавершатьАвтоматическиОперацииВемкиВнесения;		            
КонецПроцедуры

&НаКлиенте
// Процедура - Внешнее оборудование при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ВнешнееОборудованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВнешнееОборудование) И НЕ ЗначениеЗаполнено(Объект.ККММарка) Тогда
		
		ЗаполнитьСведенияОВнешнемОборудовании(Объект.ВнешнееОборудование);

	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура заполнения сведений о внешнем оборудовании
//
Процедура ЗаполнитьСведенияОВнешнемОборудовании(ВнешнееОборудование)
	
	СведенияОВнешнемОборудовании = Справочники.ПодключаемоеОборудование.ПолучитьСведенияОВнешнемОборудовании(ВнешнееОборудование);
	
	Если ТипЗнч(СведенияОВнешнемОборудовании) = Тип("Структура")
		И СведенияОВнешнемОборудовании.Свойство("Модель") Тогда
		
		Объект.ККММарка = СведенияОВнешнемОборудовании.Модель;
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить массив фр ик КТ
// 
// Возвращаемое значение:
//   - 
//
&НаСервереБезКонтекста
Функция ПолучитьМассивФрИкКТ() 
	
	Возврат Справочники.ПодключаемоеОборудование.ПолучитьМассивФрИкКТ();
	
КонецФункции

#КонецОбласти

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ЭквайринговыйТерминалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ЭквайринговыеТерминалы.ФормаВыбора",
			Новый Структура("Отбор", Объект.Организация), 
			Элемент,,,,, 
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте 
// Процедура ЭквайринговыйТерминалПриИзменении.
//
Процедура ЭквайринговыйТерминалПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Тогда
		КассаТерминала = ПолучитьКассуТерминала(Объект.ЭквайринговыйТерминал, Объект.Ссылка);
		
		Если КассаТерминала <> Неопределено Тогда
			Объект.ЭквайринговыйТерминал = Неопределено;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Терминал уже выбран в другой кассе!'; en = 'The terminal is already selected at another cash desk!'"));
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере       
// Процедура, обработчик получения кассы терминала.
//
Функция ПолучитьКассуТерминала(Терминал, ЭтаКасса)
	
	ЗапросКассаТерминала = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭквайринговыеТерминалыКассы.Ссылка КАК Касса
	|ИЗ
	|	Справочник.Кассы.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалыКассы
	|ГДЕ
	|	ЭквайринговыеТерминалыКассы.ЭквайринговыйТерминал = &ЭквайринговыйТерминал
	|	И ЭквайринговыеТерминалыКассы.Ссылка <> &Касса");
	
	ЗапросКассаТерминала.УстановитьПараметр("ЭквайринговыйТерминал"	, Терминал);
	ЗапросКассаТерминала.УстановитьПараметр("Касса"					, ЭтаКасса);
	
	РезультатКассаТерминала = ЗапросКассаТерминала.Выполнить().Выбрать();
	
	Если РезультатКассаТерминала.Следующий() Тогда
		Возврат РезультатКассаТерминала.Касса;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
// Процедура, обработчик при изменении типа кассы.
//
Процедура ТипКассыПриИзменении(Элемент)
	
	УстановитьСотсояниеЭлементов();	
	
	Если Объект.ТипКассы = ПредопределенноеЗначение("Перечисление.ТипыКасс.КассаПредприятия") Тогда 	
		
		Объект.ИспользоватьБезПодключенияОборудования = Истина;
		Объект.БлокироватьПечатьЧека 					   = Ложь;
		Объект.ЭквайринговыйТерминал 					   = Неопределено;
		Объект.ВнешнееОборудование 						   = Неопределено;
		Объект.КассаДляСдачиВыручки 					   = Неопределено;
		Объект.АвтСдачаВыемкиПриЗакрытииСмены 			   = Ложь;
		Объект.ЗавершатьАвтоматическиОперацииВемкиВнесения = Ложь;                                  	
		Объект.АвтоматическоеСписаниеМатериалов			   = Ложь;

	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик при изменении выключателя.
//
Процедура ЗавершатьАвтоматическиОперацииВемкиВнесенияПриИзменении(Элемент)
	Элементы.ГруппаКассаПредприятия.Видимость = Объект.ЗавершатьАвтоматическиОперацииВемкиВнесения;	
	Элементы.КассаДляСдачиВыручки.Видимость	  = Объект.ЗавершатьАвтоматическиОперацииВемкиВнесения;	
	
	Если Объект.ЗавершатьАвтоматическиОперацииВемкиВнесения = Ложь Тогда
		Объект.КассаДляСдачиВыручки = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик при изменении типа выемки.
//
Процедура ВыемкаИзКассыПриИзменении(Элемент)
	
	УстановитьСотсояниеЭлементов();		
	
КонецПроцедуры

#Область ОбработчикиСобытийЭквайринговыхТерминаловИСекций

&НаКлиенте
// Процедура, обработчик команды ОткрытьЭквайринговыйТерминал
//
Процедура ОткрытьЭквайринговыйТерминал(Команда)
	
	Ид = ИдентификаторЭлемента(ТекущийЭлемент.Имя);
	ДанныеЭлемента = Объект.ЭквайринговыеТерминалы.НайтиПоИдентификатору(Ид);
	Если ДанныеЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ДанныеЭлемента.Основной Тогда 
		ПоказатьЗначение(,ДанныеЭлемента.ЭквайринговыйТерминал);
	Иначе 
		СписокВариантов = Новый СписокЗначений;
		СписокВариантов.Добавить(0, Нстр("ru = 'Открыть'; en = 'Open'"));
		СписокВариантов.Добавить(1, Нстр("ru = 'Назначить основным'; en = 'Set as main'"));
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборВариантаДействияСЭквайрингом", ЭтаФорма, ДанныеЭлемента);
		ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВариантов, ТекущийЭлемент);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор варианта действия с кассой
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборВариантаДействияСЭквайрингом(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	ИначеЕсли ВыбранныйЭлемент.Значение = 0 Тогда 	
		ПоказатьЗначение(,ДополнительныеПараметры.ЭквайринговыйТерминал);
	ИначеЕсли ВыбранныйЭлемент.Значение = 1 Тогда
		// Сброс по всем строкам
		Для Каждого СтрокаТ ИЗ Объект.ЭквайринговыеТерминалы Цикл
			
			СтрокаТ.Основной = СтрокаТ.ЭквайринговыйТерминал = ДополнительныеПараметры.ЭквайринговыйТерминал;
			ИД = СтрокаТ.ПолучитьИдентификатор();
			ЭквайрингНаФорме = Элементы.Найти("ЭквайринговыйТерминал_" + ИД);
			
			Если ЭквайрингНаФорме <> Неопределено Тогда 
				  ЭквайрингНаФорме.Шрифт = Новый Шрифт(,,СтрокаТ.Основной,,,,);
			КонецЕсли;
			
		КонецЦикла;
		Объект.ЭквайринговыйТерминал = ДополнительныеПараметры.ЭквайринговыйТерминал;
        Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте  
// Процедура, обработчик команды Добавить
//
Процедура ДобавитьЭквайринговыйТерминал(Команда)
	
     ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораЭквайринга",ЭтотОбъект);
	 ОткрытьФорму("Справочник.ЭквайринговыеТерминалы.ФормаВыбора",Новый Структура("Отбор", Новый Структура("ПометкаУдаления, Организация", Ложь, Объект.Организация)),ЭтотОбъект,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик описания оповещения ОбработкаВыбораЭквайринга 
//
Процедура ОбработкаВыбораЭквайринга(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	МассивНайденныхСтрок = Объект.ЭквайринговыеТерминалы.НайтиСтроки(Новый Структура("ЭквайринговыйТерминал", ВыбранноеЗначение));
	
	Для Каждого СтрокаМассива из МассивНайденныхСтрок Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Терминал уже выбран в табличной части!'; en = 'The terminal is already selected at table!'"));				
		Возврат;	
	КонецЦикла;
	
	КассаТерминала = ПолучитьКассуТерминала(ВыбранноеЗначение, Объект.Ссылка);
	
	Если КассаТерминала <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Терминал уже выбран в другой кассе!'; en = 'The terminal is already selected at another cash desk!'"));
		Возврат;		
	КонецЕсли;
	
	СтрокаЭквайринга = Объект.ЭквайринговыеТерминалы.Добавить();
	СтрокаЭквайринга.ЭквайринговыйТерминал = ВыбранноеЗначение;
	
	Ид = СтрокаЭквайринга.ПолучитьИдентификатор();
	ВывестиЭквайрингНаФорму(Ид);
	
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды удалить эквайринговый терминал из ТЧ
//
Процедура УдалитьЭквайринговыйТерминал(Команда)
	
	Идентификатор = ИдентификаторЭлемента(ТекущийЭлемент.Имя);
	СтрокаТЧ = Объект.ЭквайринговыеТерминалы.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаТЧ <> Неопределено Тогда
		
		Объект.ЭквайринговыйТерминал = ?(СтрокаТЧ.Основной, Неопределено, Объект.ЭквайринговыйТерминал); 
		Объект.ЭквайринговыеТерминалы.Удалить(СтрокаТЧ);
		УдалитьЭквайринговыйТерминалНаФорме(Идентификатор);
		Модифицированность = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик команды удалить эквайринговый терминал с формы
//
Процедура УдалитьЭквайринговыйТерминалНаФорме(Идентификатор)
	
	МассивУдаляемых = Новый Массив;
	
	УдаляемыйЗаголовокЭквайринга = Элементы.Найти("ГруппаЭквайринг_"+Идентификатор);
	УдаляемаяКнопкаЗакрытьЭквайринг = Элементы.Найти("ГруппаЗакрытьЭквайринг_"+Идентификатор);
	
	Если УдаляемыйЗаголовокЭквайринга = Неопределено ИЛИ УдаляемаяКнопкаЗакрытьЭквайринг = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Удалить(УдаляемыйЗаголовокЭквайринга);
	Элементы.Удалить(УдаляемаяКнопкаЗакрытьЭквайринг);
КонецПроцедуры

&НаСервере
// Процедура, отображает ТЧ Эквайринговые терминалы на форму
//
Процедура ВывестиТЧЭквайринговыеТерминалы()
	
	Для каждого СтрокаТЧ Из Объект.ЭквайринговыеТерминалы Цикл
		
		ВывестиЭквайрингНаФорму(СтрокаТЧ.ПолучитьИдентификатор());	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, выводит эквайринг на форму
//
Процедура ВывестиЭквайрингНаФорму(Идентификатор)
	
	ДанныеЭквайринговогоТерминала = Объект.ЭквайринговыеТерминалы.НайтиПоИдентификатору(Идентификатор);
	
	УправлениеИнтерфейсамиСервер.КопироватьЭлементФормыРекурсивно(ЭтаФорма,Элементы.ГруппаЭквайринг_,Элементы.ГруппаВсеЭквайрингиВертикальная,Идентификатор);
	УправлениеИнтерфейсамиСервер.КопироватьЭлементФормыРекурсивно(ЭтаФорма,Элементы.ГруппаЗакрытьЭквайринг_,Элементы.ГруппаЗакрытьВсеЭквайрингиВертикальная,Идентификатор);
	
	ЭлементЭквайринговыйТерминал = Элементы.Найти("ЭквайринговыйТерминал_" + Идентификатор);
	
	Если ЭлементЭквайринговыйТерминал <> Неопределено Тогда
		
		ЭлементЭквайринговыйТерминал.Заголовок = Строка(ДанныеЭквайринговогоТерминала.ЭквайринговыйТерминал);
		Если ДанныеЭквайринговогоТерминала.Основной Тогда
			ЭлементЭквайринговыйТерминал.Шрифт = Новый Шрифт(,,Истина,,,,);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Вывести динамические элементы ТЧ
//
Процедура ВывестиДинамическиеЭлементыТЧ()
	
	Объект.ЭквайринговыеТерминалы.Сортировать("ЭквайринговыйТерминал Возр"); 
	Объект.Секции.Сортировать("СегментНоменклатуры Возр");
	
	ВывестиТЧСегменты();
	ВывестиТЧЭквайринговыеТерминалы(); 

КонецПроцедуры

&НаСервереБезКонтекста
// Функция получения Идентификатора элемента на форме
//
Функция ИдентификаторЭлемента(Имя)

	мИмени = СтрРазделить(Имя,"_");
	Если мИмени.Количество()>1 Тогда
		Возврат Число(мИмени[1]);
	Иначе
		Возврат -1;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура - Структурная единица начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СтруктурнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора",Новый Структура("Отбор", Новый Структура("ПометкаУдаления, Организация", Ложь, Объект.Организация)), Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте                                                                             
// Процедура - отображение Дополнительно.
//
Процедура СкрытьПоказатьДополнительно(Команда)
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
КонецПроцедуры

&НаКлиенте   
// Процедура дабвления сегмента секции.
//
Процедура ДобавитьСегментСекции(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораСегмента",ЭтотОбъект);
	ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора",Новый Структура("Отбор", Новый Структура("ПометкаУдаления",Ложь)),ЭтотОбъект,,,,ОписаниеОповещения);
КонецПроцедуры  

&НаКлиенте 
// Процедура - ОбработкаВыборкаСегмента.
//
Процедура ОбработкаВыбораСегмента(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	МассивНайденныхСтрок = Объект.Секции.НайтиСтроки(Новый Структура("СегментНоменклатуры", ВыбранноеЗначение));
	
	Для Каждого СтрокаМассива из МассивНайденныхСтрок Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Сегмент уже выбран в табличной части!'; en = 'The segment is already selected at table!'"));				
		Возврат;	
	КонецЦикла;
	
	СтрокаСегмента = Объект.Секции.Добавить();
	СтрокаСегмента.СегментНоменклатуры = ВыбранноеЗначение;
	СтрокаСегмента.НомерСекции = 1;
	
	Модифицированность = Истина;  
	
	Ид = СтрокаСегмента.ПолучитьИдентификатор();
	ВывестиСегментНаФорму(Ид);

КонецПроцедуры 

&НаСервере
// Процедура, выводит эквайринг на форму
//
Процедура ВывестиСегментНаФорму(Идентификатор)
	
	ДанныеСегмента = Объект.Секции.НайтиПоИдентификатору(Идентификатор);
	ИндексДанных   = Объект.Секции.Индекс(ДанныеСегмента);
	
	УправлениеИнтерфейсамиСервер.КопироватьЭлементФормыРекурсивно(ЭтаФорма,Элементы.ГруппаНаименованияСегмента_,
	Элементы.ГруппаСегментВертикальная,Идентификатор);
	
	УправлениеИнтерфейсамиСервер.КопироватьЭлементФормыРекурсивно(ЭтаФорма,Элементы.ГруппаНомерУдалитьСегмент_, 
	Элементы.ГруппаВертикальнаяНомерУдалитьСегмент,Идентификатор,ИндексДанных);
	
	ЭлементСегмент = Элементы.Найти("Сегмент_" + Идентификатор);
	
	Если ЭлементСегмент <> Неопределено Тогда
		
		ЭлементСегмент.Заголовок = Строка(ДанныеСегмента.СегментНоменклатуры);	
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте   
// Процедура - Открыть сегмент секции.
//
Процедура ОткрытьСегментСекции(Команда)
	
	Ид = ИдентификаторЭлемента(ТекущийЭлемент.Имя);
	ДанныеЭлемента = Объект.Секции.НайтиПоИдентификатору(Ид);
	
	Если ДанныеЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ДанныеЭлемента.СегментНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удалить сегмент секции.
//
Процедура УдалитьСегментСекции(Команда)
	Идентификатор = ИдентификаторЭлемента(ТекущийЭлемент.Имя);
	СтрокаТЧ = Объект.Секции.НайтиПоИдентификатору(Идентификатор);
	
	Если СтрокаТЧ <> Неопределено Тогда
		
		Объект.Секции.Удалить(СтрокаТЧ);
		УдалитьСегментНаФорме(Идентификатор);
		Модифицированность = Истина;
		ОбновитьСегменты();
		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
// Процедура, обновляет эквайринговые терминалы на форме
Процедура ОбновитьСегменты()
	
	Для Каждого СтрокаТЧ Из Объект.Секции Цикл
		
		УдалитьСегментНаФорме(СтрокаТЧ.ПолучитьИдентификатор());	
		
	КонецЦикла;
	
	ВывестиТЧСегменты();
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик команды удалить сегмент с формы
//
Процедура УдалитьСегментНаФорме(Идентификатор)
	
	УдаляемоеНаименованиеСегмента = Элементы.Найти("ГруппаНаименованияСегмента_" + Идентификатор);
	УдаляемаяКнопкаЗакрытьСегмент = Элементы.Найти("ГруппаНомерУдалитьСегмент_"  + Идентификатор);
	
	Если УдаляемоеНаименованиеСегмента = Неопределено ИЛИ УдаляемаяКнопкаЗакрытьСегмент = Неопределено Тогда
		
		Возврат;   
		
	КонецЕсли;
		
	Элементы.Удалить(УдаляемоеНаименованиеСегмента);
	Элементы.Удалить(УдаляемаяКнопкаЗакрытьСегмент);
	
КонецПроцедуры   

&НаСервере
// Процедура, отображает ТЧ Эквайринговые терминалы на форму
//
Процедура ВывестиТЧСегменты()
	
	Для каждого СтрокаТЧ Из Объект.Секции Цикл
		
		ВывестиСегментНаФорму(СтрокаТЧ.ПолучитьИдентификатор());	
		
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти
